messages/smoketest/hu-pl101-postcode.response.soap

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns3:address xmlns:ns2="http://postcode.local/postcode.request.xsd" xmlns:ns3="http://postcode.local/postcode.response.xsd">
         <street>Padualaan</street>
         <houseNumber>101</houseNumber>
         <addition/>
         <postcode>3584CH</postcode>
         <place>Urecht</place>
      </ns3:address>
   </S:Body>
</S:Envelope>