messages/smoketest/home-address.request.soap

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pos="http://postcode.local/postcode.request.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <pos:searchAddress>
         <postcode>3824AH</postcode>
         <houseNumber>42</houseNumber>
      </pos:searchAddress>
   </soapenv:Body>
</soapenv:Envelope>