messages/hu-dl200-postcode.request.soap

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pos="http://postcode.local/postcode.request.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <pos:searchPostcode>
         <street>Daltonlaan</street>
         <houseNumber>200</houseNumber>
         <addition/>
         <place>Utrecht</place>
      </pos:searchPostcode>
   </soapenv:Body>
</soapenv:Envelope>